import * as yup from "yup";

export const authFormSchema = yup.object().shape({
	email: yup
		.string()
		.required("Обязательное поле")
		.matches(
			/^(([^<>()[\]\\.,;:\s@"]+(\.[^<>()[\]\\.,;:\s@"]+)*)|.(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
			"Некорректный формат e-mail",
		),
	password: yup
		.string()
		.required("Обязательное поле")
		.matches(
			/^[\w#%]+$/,
			"Некорректный пароль. Допускаются только буквы, цифры и знаки: #, %",
		)
		.min(6, "Должно быть минимум 6 символа")
		.max(20, "Должно быть максимум 20 символов"),
});
